app/controllers/menu_item_ratings_controller.rb

SELECT "menu_item_ratings".* FROM "menu_item_ratings" WHERE ("menu_item_ratings".menu_item_id = 60)
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = 60 LIMIT 1
SELECT "menu_item_ratings".* FROM "menu_item_ratings"
---
  def index
    #@menu_item_ratings = MenuItemRating.all

    if (@menu_item)
      @menu_item_ratings = @menu_item.menu_item_ratings.find(:all, :order => 'created_at DESC')
    elsif (@user)
      @menu_item_ratings = @user.menu_item_ratings.paginate(:all,
        :page => params[:page],
        :per_page => ITEMS_PER_PAGE,
        :order => 'created_at DESC')

SELECT "menu_item_ratings".* FROM "menu_item_ratings" WHERE "menu_item_ratings"."id" = 1 AND ("menu_item_ratings".menu_item_id = 60) LIMIT 1
---
  def show
    #@menu_item_rating = @menu_item.menu_item_ratings.find(params[:id])

    @menu_item_rating = MenuItemRating.find(params[:id])

INSERT INTO "menu_item_ratings" ("user_id", "rating", "review", "menu_item_id", "created_at", "updated_at") VALUES (NULL, NULL, NULL, NULL, '2011-05-06 21:44:31.199024', '2011-05-06 21:44:31.199024') RETURNING "id"
---
  def create
      @menu_item_rating = MenuItemRating.new(params[:menu_item_rating])

      if current_user
        @menu_item_rating.user_id = current_user.id
      end

      respond_to { |format|
        if @menu_item_rating.save