app/controllers/menu_items_controller.rb

  def index
    # @menu_items = MenuItem.all

    @lat = params[:lat].to_f
    @long = params[:long].to_f
    @limit = 200

    if params[:limit] && !params[:limit].empty?
      @limit = params[:limit].to_i
    end

    # FIXME - lat & long could be specified erroneously as could the restaurant_id
    if (@lat == 0 || @long == 0)
      @menu_items = @restaurant.menu_items.find(:all, :limit => @limit)
    else
      # Lookup all the restaurants near the given lat/long and get 50 of the menu_items
      @menu_items = Restaurant.find(:all,
        :origin => [@lat, @long],
        :order=>'distance asc',
        :joins => [ :menu_items ],
        :limit => @limit)
---
SELECT "menu_items".* FROM "menu_items" WHERE ("menu_items".restaurant_id = 1230) LIMIT 5
SELECT "menu_items".* FROM "menu_items" INNER JOIN restaurants ON restaurants.id = menu_items.restaurant_id WHERE "restaurants"."limit" = 5 AND "restaurants"."origin" IN (37.77864, -122.39139) AND "restaurants"."order" = 'distance asc'
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" IS NULL LIMIT 1

  def show
    @menu_item = MenuItem.find(params[:id])
---
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = 2000 LIMIT 1