app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = 1630 LIMIT 1
---
  def index
    # @restaurants = Restaurant.find(:all, :origin => [37.77859, -122.39142], :within=>1)
    # @restaurants = Restaurant.find(:all, :origin => [37.77859, -122.39142], :order=>'distance asc', :limit => 25)
    # @restaurants = Restaurant.all

    @lat = params[:lat].to_f
    @long = params[:long].to_f
    @limit = 50

    if params[:limit] && !params[:limit].empty?
      @limit = params[:limit].to_i
    end

    @restaurants = Restaurant.find(:all, :origin => [@lat, @long], :order=>'distance asc', :limit => @limit)

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = 1 LIMIT 1
---
  def show
    @restaurant = Restaurant.find(params[:id])